package com.renj.kotlin.kt

/**
 * ======================================================================
 *
 * 作者：Renj
 *
 * 创建时间：2023-03-30   11:45
 *
 * 描述：
 *
 * 修订历史：
 *
 * ======================================================================
 */
/**
 * 将集合变成字符串返回
 */
fun <T> Collection<T>.string(list: (T) -> String) =
    StringBuilder("\n[").also { sb ->
        //'遍历集合元素，通过 map 表达式将元素转换成感兴趣的字串，并独占一行'
        this.forEach { e -> sb.append("\n\t${list(e)},") }
        sb.append("\n]")
    }.toString()


